{"id":"ckoiq68eo22hf0a0990wcpuzj","timeInMinutes":20,"name":"Loaded Nachos","description":"Loaded Nachos","ingredients":[{"ingredients":[{"name":"Ground beef","unit":"kg","amount":"1.5"},{"name":"Onion","unit":"g","amount":"17"},{"name":"Tomato sauce","unit":"g","amount":"40"},{"name":"Water","unit":"ml","amount":"120"},{"name":"Chilli powder","unit":"g","amount":"10"},{"name":"Avococado","unit":"g","amount":"50"},{"name":"Fresh Cilantro","unit":"g","amount":"50"},{"name":"Limejuice","unit":"ml","amount":"10"},{"name":"Olive oil","unit":"ml","amount":"15"},{"name":"Salt","unit":"g","amount":"5"},{"name":"Tortilla chips","unit":"g","amount":"120"},{"name":"Cheddar cheese","unit":"g","amount":"70"},{"name":"Pickled jalapenos","unit":"g","amount":"40"},{"name":"Sour cream","unit":"g","amount":"45"},{"name":"Hot sauce","unit":"ml","amount":"15"}]}],"steps":["Start by making the guac and pico. To make the guacamole, mash the avocado in a bowl, then stir in the onion, cilantro, lime and salt and set aside. To make the pico, toss together the tomatoes, onion, cilantro, lime and salt and set that aside as well.\n","For the beef, preheat a skillet over medium high heat, add the olive oil, allow it to get nice and hot then add the beef, onion and cilantro along with a pinch of salt and cook (while stirring and breaking up the beef) until the beef is fully cooked through, about 4 to 5 minutes. If the beef renders out too much fat, discard it."," Add the tomato sauce, water and spices to the beef , lower the heat to medium low and cook for about 10 minutes, adjust the salt to taste and remove from the heat.\n"," Preheat your broiler. Scatter the tortillas in an oven safe dish (preferably the same dish you plan on serving this in) then spoon over the beef mixture, scatter the cheese all over the top and pop it under the broiler for a couple of minutes to melt the cheese.\n","When they come out of the broiler, top with the pico, guac, sour cream, jalapenos and hot sauce. Dig in right away!"],"photo":{"url":"https://media.graphcms.com/5jMT6thfS2qtXMUwJLeG"},"tags":[{"id":"ckqmad7js4nbf0a035yiwtqyz"}]}