{"id":"ckoioil141axu0a09lbw6hfjw","timeInMinutes":20,"name":"Blackened Roasted Salmon","description":"Blackened Roasted Salmon with arugula salad, updated","ingredients":[{"ingredients":[{"name":"Unsalted Butter","unit":"ml","amount":"120"},{"name":"Salmon Filets, about 6oz each","unit":"g","amount":"170"},{"name":"Blackened Seasoning","unit":"g","amount":"40"},{"name":"lemon","unit":"g","amount":"20"},{"name":"Arugula","unit":"g","amount":"300"},{"name":"Fresh Dill","unit":"g","amount":"50"},{"name":"Fresh Parsely","unit":"g","amount":"50"},{"name":"Capers","unit":"g","amount":"10"},{"name":"Olive oil","unit":"ml","amount":"15"},{"name":"Salt","unit":"g","amount":"5"}]}],"steps":["Preheat the oven to 400 degrees and start making the browned butter.","In a small skillet, add the butter and slowly start melting it and cooking it until it turns a deep golden brown color, making sure to remove any milk solids that float to the top (do not rush this process, you want browned butter not burned butter) once there, set aside.","Place your salmon (and the lemon halves) on a parchment paper lined baking sheet, spoon over some of the browned butter and generously sprinkle with the blackened seasoning, pop it in the oven for about 8-10 minutes (do not overcook!!) meanwhile assemble your salad.","In a bowl, toss together the arugula, dill, parsley, capers, salt and a drizzle of oil, place on a platter and set aside.","When the salmon is ready, add to the platter alongside the salad, drizzle over some more browned butter then squeeze the roasted lemon all over the salad and salmon and dig in!","When the salmon is ready, add to the platter alongside the salad, drizzle over some more browned butter then squeeze the roasted lemon all over the salad and salmon and dig in!","This makes more browned butter than you need but you can store it in a jar in the fridge and add a spoonful to anything such as roasted vegetables or as a base for rice pilaf. You can halve the recipe for it if you'd like!"],"photo":{"url":"https://media.graphcms.com/MFhHzyB6TCedCm5ZOubg"},"tags":[{"id":"ckq3n5lw0bqeo0b56woalar89"}]}