{"id":"ckoj4qes01ez70a534ml9m3z1","timeInMinutes":15,"name":"Potato Cauliflower and Leek Soup","description":"Potato Cauliflower and Leek Soup\n","ingredients":[{"ingredient":[{"name":"Russet or Yukon Gold Potatoes, peeled and chopped","unit":"g","amount":"453"},{"name":"Cauliflower, trimmed and cut into florets, 1/4 of it reserved for the topping","unit":"g","amount":"453"},{"name":"Large (or 3 smaller) Leeks, trimmed, sliced and thoroughly washed","unit":"g","amount":"450"},{"name":"Butter","unit":"ml","amount":"30"},{"name":" Olive Oil","unit":"ml","amount":"30"},{"name":"Chicken Stock","unit":"ml","amount":"30"},{"name":"Salt and Pepper, to taste","unit":"ml","amount":"15"},{"name":"Half and Half","unit":"ml","amount":"118"},{"name":"Garlic, thinly sliced","unit":"g","amount":"45"},{"name":"Chopped Parsley","unit":"ml","amount":"30"},{"name":"Parm","unit":"g","amount":"89.9"},{"name":"Creme Fraiche or Sour Cream","unit":"g","amount":"118"}]}],"steps":["1) In a large heavy bottom pot, add the oil and butter and preheat over medium heat, add the leeks along with a pinch of salt and cook until slightly caramelized and softened, about 10 minutes.","2) Add the potatoes and cauliflower and enough stock to cover about two inches above the veggies, bring to a boil, partially cover, simmer on low until the potatoes are tender.","3) Once the potatoes are tender, taste for seasoning and adjust to your preference, remove from the heat, puree using an immersion blender then stir in the half and half and put back on low to keep it warm, meanwhile make your topping.","4) In a small skillet, add the oil, once hot over medium heat, add the remaining 1/4 cauliflower head (finely chopped) and garlic, saute until they get brown and crispy, at the last minute, add in the parsley and season with salt and pepper.","5) Ladle the soup in bowls, top with some of your topping and an extra grating of parm and black pepper (and some sour cream if you fancy) and dig in!"],"photo":{"url":"https://media.graphcms.com/e2VIm8MsSsqjhgszjJpJ"},"tags":[{"id":"ckqrumak0b8cn0b5003080p3h"}]}