{"id":"ckoj4263c1anc0a595kh0bzgw","timeInMinutes":30,"name":"Ultimate Classic Chicken Marsala","description":"Ultimate Classic Chicken Marsala\n","ingredients":[{"ingredients":[{"name":"Boneless Skinless Chicken Thighs, trimmed and pounded thinly","unit":"g","amount":"267"},{"name":"Olive Oil","unit":"g","amount":"8.4"},{"name":" Unsalted Butte","unit":"g","amount":"8.4"},{"name":"All Purpose Flour","unit":"ml","amount":"240"},{"name":"Mixed Mushrooms, roughly torn or cut in half","unit":"g","amount":"453"},{"name":"Yellow Onion, sliced","unit":"g","amount":"170"},{"name":"Cloves of Garlic, sliced","unit":"g","amount":"108"},{"name":"Dry Marsala Wine","unit":"ml","amount":"177"},{"name":"Beef Stock","unit":"ml","amount":"118"},{"name":"Salt and Pepper to taste","unit":"ml","amount":"15"},{"name":"Fresh Chopped Parsley","unit":"ml","amount":"30"}]}],"steps":["1) Add one tablespoon of butter and the oil into a large non-stick skillet, melt over medium high heat. Meanwhile season both sides of the chicken with salt and pepper and dredge in the flour (shake off excess) add them to the hot skillet, sear for a couple minutes on each side or until golden brown, remove to a plate.","2) To the skillet (add a touch more oil if needed) add the mushrooms and onions along with a pinch of salt, sauté on medium heat, until they brown and soften, about 10 minutes, add the garlic and cook for 30 more seconds.","3) Deglaze with the Marsala, allow it to reduce by half, then add the stock along with the seared chicken, bring to a bubble, reduce the heat to medium-low and cook for about 10 minutes or until the sauce has thickened and reduced by about half.","4) Remove the chicken, place it on a serving platter, then take the last Tbsp of butter, dredge it in flour, add it to the sauce, cook a couple minutes or until thickened and glossy, adjust the seasoning to taste, add the fresh parsley and spoon over the chicken. Enjoy!"],"photo":{"url":"https://media.graphcms.com/6QpwaA6iTfWvRPClKgj5"},"tags":[{"id":"ckqmf97749z8b0c00giwcw7tg"}]}