{"id":"ckolg03g02y3k0a60pchc8t9f","timeInMinutes":40,"name":"Indian Spiced Potato Hash with Fried Egg","description":"Indian Spiced Potato Hash with Fried Egg, a delicious way to switch up yourbreakfasts!","photo":{"url":"https://media.graphcms.com/4KfL3v3fTKS3tkdkjJgh"},"ingredients":[{"ingredients":[{"name":"Cooked potatoes","unit":"g","amount":"60"},{"name":" Mustard seeds","unit":"g","amount":"15"},{"name":"Coriander seeds","unit":"g","amount":"15"},{"name":"Garam masala","unit":"g","amount":"10"},{"name":"Ground cumin","unit":"g","amount":"10"},{"name":"Ground coriander","unit":"g","amount":"10"},{"name":"Mango Powder","unit":"g","amount":"10"},{"name":"Cayenne Pepper","unit":"g","amount":"10"},{"name":"Chili Powder","unit":"g","amount":"5"},{"name":"Grated Ginger","unit":"g","amount":"15"},{"name":"Yellow onion","unit":"g","amount":"40"},{"name":"Vegetable Oil or Ghee","unit":"ml","amount":"45"},{"name":"chopped scallions and cilantro","unit":"g","amount":"150"},{"name":"Salt","unit":"g","amount":"5"}]}],"steps":["1) Peel and dice the potatoes into small cubes, place them in a large saucepan, cover with water, bring to a boil over medium heat and boil them for about 5 minutes or until they are about 3/4 of the way cooked through. Drain them well once cooked and set them aside.","2) In a large skillet, add the oil along with the mustard seeds, coriander seeds and cumin seeds, heat them over medium heat. As soon as the whole spices start popping, add the onion, garlic and ginger and saute for a couple of minutes.\n","3) Add the potatoes making sure to stir them well in the spiced oil, cook them over medium high heat for about 10 minutes giving them a stir occasionally to make sure they are browning well.","4) Mix together the remaining spices, sprinkle about 1 tsp of the mixture over the potatoes along with some salt, cook for an additional minute or two, stir in the coriander and scallions and serve with a fried egg!","NOTE: You won’t use all of the powdered spice blend so if you’d like, cut the amounts into thirds. I suggest making the whole batch so you have the spice mixture ready on hand next time you want to make something exotic."]}