{"id":"ckolau6jk6ivf0c058pkkqtke","timeInMinutes":55,"name":"Eggplant Meatballs","description":"Eggplant Meatballs are a delicious vegetarian meat substitute, enjoy!","ingredients":[{"ingredients":[{"name":" Eggplant,","unit":"kg","amount":"0.5"},{"name":"Italian Seasoned Bread Crumbs","unit":"g","amount":"150"},{"name":"All Purpose Flour","unit":"g","amount":"30"},{"name":"Grated Pecorino","unit":"g","amount":"125"},{"name":"Freshly Grated Parm","unit":"g","amount":"43"},{"name":"Egg","unit":"g","amount":"57"},{"name":"Chopped Parsely","unit":"g","amount":"20"},{"name":"Olive oil","unit":"ml","amount":"15"},{"name":"Mince garlic","unit":"g","amount":"15"},{"name":"Salt","unit":"g","amount":"5"},{"name":"Pepper","unit":"g","amount":"5"},{"name":"San Marzano Tomatoes or Crushed Tomatoes","unit":"g","amount":"793"},{"name":"Fresh basil","unit":"g","amount":"20"},{"name":"Dried Oregano","unit":"g","amount":"5"}]}],"steps":["1) Add one tablespoon of olive oil to either a large skillet or medium size saucepan, add the eggplant, stir around to coat, then add the water along with a pinch of salt, stir well, cover and simmer (stirring occasionally) for about 20 minutes or until the eggplant is really soft, remove to a shallow bowl and allow to cool.","2) In a large bowl, add the cooked and cooled eggplant, breadcrumbs, egg, herbs, garlic, cheeses, flour and pinch of salt, mix together well then pop the mixture (covered) in the freezer for 10 minutes, meanwhile preheat your oven to 375 degrees.","3) Line a baking sheet with some parchment paper, grease with some olive oil, then grab a bowl, add some water and set it aside.","4) Wet your hands in the water as you roll the \"meatballs\" so the mixture doesn't stick, once all rolled, brush with a little olive oil and bake for 20 minutes, meanwhile lets make the sauce.","5) In a large skillet (nonstick) add the olive oil and garlic, allow it to sizzle for a minute, then add the tomatoes with a splash of water, bring to a simmer (If using canned plum tomatoes make sure you break them up as much as you can with a wooden spoon once they are up to a simmer) add the basil, oregano and a healthy pinch of salt and let it simmer 20 minutes.","6) Add the eggplant meatballs to the sauce, carefully spoon some of the sauce on top of the eggplant then cover and simmer for 5 minutes (not longer than 5 minutes or they will fall apart) , sprinkle more parm on top and serve!","NOTE: When you're mixing your eggplant mixture, if it looks too wet add a touch more breadcrumbs (up to 1/3 cup) until the mixture thickens. Depending on how much moisture is left in the eggplant it can be a little looser so adding a touch more breadcrumbs will fix it! Also, if you like a bit more texture, I suggest shallow frying the meatballs instead of baking. Simply shallow fry in a nonstick skillet using light olive oil until golden brown and crispy on all sides and draining on a paper towel lined plate.\n"],"photo":{"url":"https://media.graphcms.com/02xHCJOShiCzZYAUiy4A"},"tags":[{"id":"ckqthd74o1u710c95qoogykq6"}]}