{"id":"ckol9ud6w0viv0a062zl76qq4","timeInMinutes":90,"name":"Eggplant parm 2 ways","description":"Eggplant is usually a tricky vegetable, this recipe transforms them into a treat! enjoy!","photo":null,"ingredients":[{"ingredients":[{"name":"Hot Pepper Flakes","unit":"g","amount":"5"},{"name":"San Marzano Tomatoes","unit":"g","amount":"150"},{"name":"Fresh Basil","unit":"g","amount":"20"},{"name":" Eggplant","unit":"kg","amount":"1"},{"name":"Eggs","unit":"g","amount":"350"},{"name":" Freshly Grated Parm","unit":"g","amount":"80"},{"name":"All Purpose Flour","unit":"g","amount":"80"},{"name":"Olive oil","unit":"ml","amount":"15"},{"name":"Salt","unit":"g","amount":"5"},{"name":"Pepper","unit":"g","amount":"5"},{"name":"Fresh Mozzarella","unit":"g","amount":"30"},{"name":"Fresh Grated Parmesan","unit":"g","amount":"30"}]}],"steps":["1) Start by making the sauce. In a saucepan, add the oil, garlic and hot pepper flakes, bring to a sizzle and once the garlic becomes fragrant and becomes lightly golden, add the tomatoes, salt and basil, give it a stir, partially cover and simmer on medium low for about 30 minutes while you fry the eggplant.","2) Slice the eggplant thinly with either a mandolin or a sharp knife, they must be thin but not see through.","3) On a shallow plate, add the flour and season with salt and pepper, set aside. In a separate shallow bowl, whisk together the eggs, parm, salt and pepper, set aside.","4) In a large skillet, add about 1/2 inch of oil, preheat over medium heat (not too hot or the eggplant will burn on the outside but will remain raw on the inside) once hot, dredge each piece of eggplant in the flour, shake off any excess, dip into the beaten egg mixture, then add to the hot oil and cook for a few minutes on each side or until golden brown.","5) Drain the eggplant on a paper towel lined plate, blot excess oil and season with a pinch of salt, repeat this process until all the eggplant is cooked.","6) To assemble the baked version, layer the cooked eggplant with some sauce, parm and mozzarella, bake for about half an hour in a 375 degree oven until bubbly and cheese melted, allow to cool for a couple of hours before serving.","7) To assemble the home style version, layer the eggplant with sauce and lots of parm, allow to sit about an hour before serving.\n"]}