{"id":"ckolb1ols6osl0c56e8co8pne","timeInMinutes":50,"name":"Pasta with Escarole and Meatballs","description":"Pasta with Escarole and Meatballs","ingredients":[{"ingredients":[{"name":"Ground Beef","unit":"g","amount":"227"},{"name":"Italian Sausage, casing removed","unit":"g","amount":"227"},{"name":" Egg","unit":"g","amount":"50"},{"name":"cup of Breadcrumbs","unit":"g","amount":"119"},{"name":"cup of Freshly Grated Parm","unit":"g","amount":"89.9"},{"name":"cup of Golden Raisins, soaked in boiling water for 15 minutes then squeezed out of any extra water and roughly chop","unit":"g","amount":"85"},{"name":"Fish, such as cod, halibut or tilapia (or a combo of all 3), cut into strips","unit":"g","amount":"453"},{"name":"cup of Toasted Pine Nuts, coarsely chopped","unit":"g","amount":"47"},{"name":"Cloves of Garlic, minced","unit":"g","amount":"2.84"},{"name":"Chopped Parsley","unit":"ml","amount":"44"},{"name":"Drizzle (about a tsp) of Honey","unit":"g","amount":"5.69"},{"name":"Salt and Pepper to taste","unit":"ml","amount":"5"},{"name":"Bunches of Escarole, roughly chopped and well washed","unit":"g","amount":"340"},{"name":"Cloves of Garlic, smashed and peeled","unit":"g","amount":"17.07"},{"name":"Tbsp of Olive Oil","unit":"g","amount":"28.35"},{"name":"Pinch of Hot Pepper Flakes","unit":"g","amount":"4.2"},{"name":"Freshly Grated Parm","unit":"g","amount":"89.9"},{"name":"Orecchiette Pasta","unit":"g","amount":"453"}]}],"steps":["1) Fill a large pot with water, add a generous pinch of salt and bring to a boil, meanwhile, make the meatballs.","2) In a bowl, add the ingredients for the meatballs, mix to combine and form into tiny meatballs.\n","3) In a large shallow dutch oven, add the olive oil and preheat over medium heat, add the meatballs (you will have to do this in batches) and sear all over and make sure they are just about cooked through, then add the garlic and a pinch of hot pepper flakes, cook for a minute, then add the escarole and cover the pot with a lid to help the escarole cook dow, about 8 minutes, this is the point which you will add the pasta to the boiling water.","4) Cook the pasta a couple minutes shy of package instructions and before draining, reserve about a cup of the starchy cooking water.","5) Once the escarole has cooked down, remove the lid, season with salt and pepper, add the drained pasta along with about 1/2 cup of the starchy cooking water and a handful of parm, cook for about 2 minutes then remove from the heat, cover and let it sit for about 5 minutes, then serve with extra parm and extra toasted pine nuts."],"photo":{"url":"https://media.graphcms.com/MBHHwwsuRJqVVgn4oFkb"},"tags":[{"id":"ckq7qjyfsdi210a60xzj21q06"}]}