{"id":"ckomut8zc6u2d0b088rois3re","timeInMinutes":45,"name":"Swedish meatballs","description":"Swedish meatballs\n","photo":{"url":"https://media.graphcms.com/W5GxVOe0SwmugN2TKHCw"},"ingredients":[{"ingredients":[{"name":"1lb of Ground Beef","unit":"g","amount":"454"},{"name":"1 lb of Ground Pork","unit":"g","amount":"454"},{"name":"1 Egg","unit":"g","amount":"30"},{"name":"/3 cup of Panko Breadcrumbs","unit":"g","amount":"29.8"},{"name":"1/4 cup of Milk","unit":"ml","amount":"59"},{"name":" Small Yellow Onion, finely chopped in a food processor","unit":"g","amount":"115"},{"name":"1/4 tsp of Ground Nutmeg","unit":"g","amount":"0.59"},{"name":"1/4 tsp of Ground Allspice","unit":"g","amount":"0.59"},{"name":"4 Tbsp of Unsalted Butter","unit":"g","amount":"56.7"},{"name":"4 Tbsp of Flour","unit":"g","amount":"56.7"},{"name":"1 Tbsp of Olive Oil","unit":"g","amount":"14.17"},{"name":"3 cups of Beef Stock","unit":"g","amount":"738"},{"name":"1/2 cup of Sour Cream","unit":"ml","amount":"118"},{"name":"3 Tbsp of Chopped Parsley","unit":"g","amount":"28.35"}]}],"steps":["1) Pour the milk over the panko breadcrumbs and set aside. In a large skillet, add 1 tablespoon of butter, along with the onion and a pinch of salt, saute for about 5 minutes, remove from the heat, stir in the nutmeg and allspice then set aside on a plate to cool.","2) In a large bowl, add the ground beef, ground pork, cooked onion mixture, panko mixture, egg, salt and pepper, mix together well and form into about 30 meatballs. In the same skillet, add 1 tablespoon of olive oil, preheat over medium heat and working in 2 batches, sear the meatballs on both sides just until they develop some color, then remove them to a plate.","3) Add the remaining butter in the same skillet, allow it to melt, stir in the flour and cook for about 30 seconds stirring the whole time, add the beef stock, bring to a boil then add the meatballs back in and simmer for about 10 to 15 minutes or until the meatballs are fully cooked through.","4) Stir in the sour cream and parsley and serve either over buttered egg noodles or mashed potatoes.\n"]}