{"id":"ckonbcfog69qq0b629a52zboe","timeInMinutes":25,"name":"Tuna Pasta Salad","description":"Tuna Pasta Salad\n","photo":{"url":"https://media.graphcms.com/1KMGyS4dSfuoijpZLDoI"},"ingredients":[{"ingredients":[{"name":"2 cup of Short Cut Pasta such as bow ties or penne","unit":"g","amount":"300"},{"name":"8 Tuna Steak","unit":"g","amount":"227"},{"name":"2 Lemons","unit":"g","amount":"84"},{"name":"1/4 of a Small Red Onion, minced","unit":"g","amount":"13"},{"name":"1/4 cup of Parsley, finely chopped","unit":"g","amount":"60.00"},{"name":"2 Cups of Halved Cherry Tomatoes","unit":"g","amount":"149.00"},{"name":"2 Garlic Cloves","unit":"g","amount":"2.80"},{"name":"1/4 cup of Extra Virgin Olive Oil","unit":"g","amount":"32.5"},{"name":"4 of Arugula, chopped","unit":"g","amount":"113.40"},{"name":"1/2 cup of Pitted Kalamata Olives, halved","unit":"g","amount":"90"},{"name":"Salt and Pepper, to taste","unit":"g","amount":"13.3"},{"name":"Black Peppercorns","unit":"g","amount":"2"}]}],"steps":["1) Fill a large pot with water, add a generous sprinkle of salt and bring to a boil.\n","2) In a skillet with high hides, fill it 3/4 of the way with water, add a pinch of salt, the garlic cloves, a few peppercorns, 1 lemon, halved, a few sprigs of parsley and a drizzle of olive oil. Bring to a simmer, add the tuna steak and cook poach it on medium heat for about 15 minutes or until it flakes easily, remove to a plate and allow it to cool.","3) Add the pasta to the boiling water, cook according to package instructions, drain and rinse under cold water to stop it from cooking.","4) In a bowl, add the red onion, celery, cherry tomatoes, parsley, arugula, black olives, small pinch of salt, pepper, olive oil and juice of 1/2 lemon (add the juice from the remaining half if you like it a bit more lemony)","5) Flake the tuna in and gently stir everything together making sure not to break up the tuna too much.\n","6) Add the pasta, toss everything together well, cover and pop it in the fridge for about 20 minutes to allow all the flavors to blend together."]}