{"id":"ckon747qo9onv0b94upp94986","timeInMinutes":20,"name":"Pennette with Tuna and Tomatoes","description":"Pennette with Tuna and Tomatoes\n","ingredients":[{"ingredients":[{"name":"10 of Pennette Pasta or any medium cut pasta of your choice","unit":"g","amount":"125"},{"name":"1 of Fresh Tomatoes, chopped into bite size pieces","unit":"g","amount":"28.35"},{"name":"2 Cloves of Garlic","unit":"Kg","amount":"7.25"},{"name":"3 Tbsp of Olive Oil","unit":"g","amount":"41"},{"name":"1 of 6 can of Tuna Packed in Olive Oil, drained","unit":"g","amount":"160"},{"name":"Fresh Basil Leaves","unit":"g","amount":"20.1"},{"name":"Salt and Pepper, to taste","unit":"g","amount":"13.3"}]}],"steps":["1) Fill a pot with water, add a pinch of salt, add the potatoes, bring to a boil and cook the potatoes until tender but not mushy, drain well and set aside.","2) In a large bowl, add all of the remaining ingredients along with the cooked potatoes, season everything to taste, give it a good toss to make sure everything is equally distributed then cover and pop it in the fridge to cool for about an hour before serving.","1) Fill a large pot with water, add a generous pinch of salt and bring to a boil.\n","2) In a skillet, add the oil and garlic and allow it to heat up and sizzle over medium heat, then add the tomatoes along with a pinch of salt and the basil and cook for about 10 minutes.","3) After you add the tomatoes to the skillet and they cook for about 2 minutes, that’s when you want to add the pasta to the boiling water, cook according to package instructions, reserve about 1/2 cup of the cooking water and drain the pasta well.","4) After 10 minutes, add the tuna to the tomatoes, cook for just a couple of minutes, then add the drained pasta to the sauce along with the cooking water, cook all together for about a minute, then remove from the heat and let the pasta sit for about 5 minutes. Adjust the seasoning according to taste and dig in!"],"photo":{"url":"https://media.graphcms.com/jm3oc9HxQmGv8Xn1kpSq"},"tags":[{"id":"ckqtqruhk7b5g0b52nitss38n"},{"id":"ckqtfw33c0gl30b98l826a2cz"}]}