{"id":"ckos16z4wnlss0a01zcfcmp0e","timeInMinutes":65,"name":"Pasta With Vodka Sauce Sausage And Peas","description":"Easy meal to make for friends and family a yummy taste ,kids will love it. ENJOY!!","photo":{"url":"https://media.graphcms.com/y7e1IuUTSpWUXpTxfs9s"},"ingredients":[{"Ingredients":[{"name":"Sausage Links, sliced into coins","unit":"kg","amount":"1"},{"name":"Olive Oil","unit":"ml","amount":"15"},{"name":"Small Onion,smashed","unit":"ml","amount":"125"},{"name":"Cloves of Garlic,smashed","unit":"ml","amount":"250"},{"name":"Hot Pepper Flakes","unit":"ml","amount":"5"},{"name":"Can of Crashed Tomatoes","unit":"g","amount":"840"},{"name":"Water","unit":"ml","amount":"125"},{"name":"Vodka","unit":"ml","amount":"83.5"},{"name":"Italian Seasoning","unit":"ml","amount":"10"},{"name":"Heavy Cream","unit":"ml","amount":"125"},{"name":"Frozen Peas","unit":"ml","amount":"205"},{"name":"Fresh Basil","unit":"ml","amount":"120"},{"name":"Pasta of your choice","unit":"g","amount":"500"}]}],"steps":["1) Fill a large pot with water, add a generous pinch of salt, bring to a boil.\n\n2) In a shallow dutch oven or skillet with high sides, add a drizzle of olive oil and cook the sausage until crispy around the edges, remove to a plate, to the same pot (add more oil if you feel you need to) add the onions and garlic along with a small pinch of salt and saute for a few minutes or until soft and translucent.\n\n3) Add the vodka, allow to reduce by half, then add the crushed tomatoes (with the water) hot pepper flakes, Italian seasoning, cooked sausage, bring to a boil, partially cover and simmer for about 20 minutes.\n\n4) Add the peas and heavy cream (taste for seasoning and add more salt if you need it) reduce the heat to low, and now add the pasta to the boiling water, cook according to package instructions (reserve 1/2 cup of the starchy cooking water before draining) then drain well.\n\n5) Add the pasta to the sauce( along with some of the starchy water if your sauce has thickened too much) toss in a handful of grated parm and some fresh basil, cook everything together for about a minute or so then serve!"]}