{"id":"ckotziixsepbf0c57ml6vl4j4","timeInMinutes":40,"name":"Bacon Chicken Pasta","description":"Imagine food that have Bacon in it how delicious it will be yummy yummy. ENJOY!!!!","photo":null,"ingredients":[{"Ingredients":[{"name":"Boneless Skinless Chicken Thighs,cut into bite size pieces","unit":"g","amount":"250"},{"name":"Thick Cut Bacon,chopped","unit":"g","amount":"100"},{"name":"Chicken Seasoning","unit":"ml","amount":"30"},{"name":"Small Yellow Onion","unit":"ml","amount":"10"},{"name":"Cloves of Garlic","unit":"ml","amount":"10"},{"name":"Chicken Stock","unit":"ml","amount":"180"},{"name":"Heavy Cream","unit":"ml","amount":"125"},{"name":"Parmogiano Reggiano","unit":"ml","amount":"125"},{"name":"Fresh Chopped Parsley","unit":"ml","amount":"5"},{"name":"Penne","unit":"g","amount":"360"},{"name":"Salt and Pepper to taste","unit":"ml","amount":"5-10"},{"name":"Unsalted Butter","unit":"ml","amount":"60"}]}],"steps":["\nPreparation\n1) Fill a large pot with water, add a generous sprinkle of salt and bring to a boil.\n\n2) In a large skillet with high sides, add the bacon and cook over medium heat until it renders its fat and becomes crispy, about 3 to 5 minutes, remove to a plate with a slotted spoon and discard most of the fat leaving behind just 1 tablespoon.\n\n3) Add the butter and allow it to melt. Mix together the chicken with the seasoning and add it to the hot pan.\n\n4) Cook it stirring it around for about 4 to 5 minutes or until all the sides of the chicken have developed some color.\n\n5) Add the onion and garlic and cook for about 7 minutes or until the onions become translucent.\n\n6) Add the stock (this is the point where you need to add the pasta to the boiling water, cook it according to package instructions and drain well.) and allow it to bubble away for about 5 to 6 minutes or until the liquid has reduced by half.\n\n7) Add the heavy cream along with a small pinch of salt and pepper and fresh chopped parsley, allow the cream to simmer for a couple of minutes.\n\n8) Add the pasta to the sauce along with the cooked bacon and parmiggiano and give everything a good stir to make sure every piece of pasta is coated in the sauce.\n\nServe right away!"]}