{"id":"ckou0w8ag0okc0c56vclpb1mw","timeInMinutes":55,"name":"Pasta Alla Pizzaiola","description":"Its good to always play around with food and come up with new recipes for the family and friends. ENJOY!!","ingredients":[{"Ingredients":[{"name":"Olive Oil","unit":"ml","amount":"30-45"},{"name":"Very Thinly Sliced Rib Eye Steaks","unit":"g","amount":"240"},{"name":"Cloves of Garlic ,Peeled and Chopped","unit":"ml","amount":"15"},{"name":"Italian Crushed Tomatoes","unit":"g","amount":"840"},{"name":"Dried Oregano","unit":"ml","amount":"5"},{"name":"Salt and Pepper","unit":"ml","amount":"5-10"},{"name":"Medium Cut Pasta,such as Penne","unit":"g","amount":"300"},{"name":"Fresh Basil Leaves","unit":"ml","amount":"45"},{"name":"Freshly Grated Parmiggiano","unit":"ml","amount":"250"}]}],"steps":["\nPreparation\n1) Fill a pot with water, add a generous pinch of salt and allow it to come to a boil. Season both sides of the steaks with a little salt and pepper and set aside.\n\n2) In a skillet with high sides, add about 2 tablespoons of oil, preheat it over medium-high heat and sear the steaks for about 30 seconds on each side, remove to a plate.\n\n3) In the same skillet, reduce the heat to low, (remove any black burned bits with a paper towel) add a little more oil plus the garlic, saute for about 30 seconds then add the crushed tomatoes, a pinch of salt and pepper and the oregano. Bring the sauce to a boil, add the meat back in (along with all the juices collected in the bottom of the plate, reduce the heat to medium-low, cover and simmer for about 30 minutes.\n\n4) At the 30 minute mark, add the pasta to the boiling water, cook according to package instructions, drain well and place the pasta back in the same pot.\n\n5) Add the basil to the sauce, taste for seasoning and adjust according to taste, then take some of the sauce and stir it with the pasta along with a little grating of fresh parm.\n\n6) Serve the pasta with some of the beef and some extra sauce!"],"photo":{"url":"https://media.graphcms.com/gwhExnj7Q1aw8b8MYKnA"},"tags":[]}