{"id":"ckou1vxs818sc0c56e02jl28s","timeInMinutes":18,"name":"Chicken Fajita Pasta","description":"Yummy and easy to make a quick meal with easy steps to follow . ENJOY!!","photo":{"url":"https://media.graphcms.com/ngHDzfwSp2J6BDKylrZh"},"ingredients":[{"Ingredients":[{"name":"Boneless Skinless Chicken Breast cut into bite size pieces","unit":"g","amount":"500"},{"name":"Bow Tie Pasta or Pasta of your choice","unit":"g","amount":"360"},{"name":"Red Bell Pepper,cut into strips","unit":"g","amount":"5"},{"name":"Yellow Onion,cut into half moon slices","unit":"g","amount":"5-10"},{"name":"Yellow Bell Pepper,cut into strips","unit":"g","amount":"5"},{"name":"Cloves of Garlic","unit":"ml","amount":"20"},{"name":"Taco Seasoning","unit":"ml","amount":"45"},{"name":"Canned Diced Tomatoes","unit":"g","amount":"240"},{"name":"Chicken Stock","unit":"ml","amount":"375"},{"name":"Heavy Cream","unit":"ml","amount":"62.5"},{"name":"Fresh Chopped Parsley","unit":"ml","amount":"30"},{"name":"Vegetable Oil","unit":"ml","amount":"45"},{"name":"Salt and Pepper","unit":"ml","amount":"5"}]}],"steps":["1) Fill a large pot with water, add a generous sprinkle of salt and bring to a boil.\n\n2) Season the chicken with some salt and half of the seasoning mix.\n\n3) Preheat a large skillet over medium heat, add the oil, add the chicken and cook for about 3 to 4 minutes or until they develop some color on all sides, remove from the pan to a plate.\n\n4) Add the onions, garlic and peppers along with the remaining seasoning and saute for about 6 to 8 minutes or until the veggies develop a bit of color and cook down a bit, add the stock along with the canned tomatoes, bring to a boil, reduce the heat to medium low and simmer for about 15 minutes.\n\n5) Halfway through cooking, add the pasta to the boiling water, cook according to package instructions, drain and set aside.\n\n6) After the 15 minutes, add the cream, allow it to simmer for a minute, toss with the parsley and cooked pasta and serve right away!"]}