{"id":"ckqc1fx08xxz40a10nkq5dusu","timeInMinutes":30,"name":"Pasta alla Siciliana","description":"This meal can be enjoyed with the whole family.","ingredients":[{"ingredients":[{"name":"Pasta of your choice","unit":"g","amount":"500"},{"name":"Olive oil","unit":"ml","amount":"30"},{"name":"Italian Peeled Crushed Tomatoes","unit":"g","amount":"473"},{"name":"Eggplant","unit":"ml","amount":"79"},{"name":"Small Onion, diced","unit":"ml","amount":"59"},{"name":"Cloves of Garlic, minced","unit":"ml","amount":"15"},{"name":"Mozzarella, cubed","unit":"ml","amount":"237"},{"name":" Parmiggiano Reggiano","unit":"ml","amount":"59"},{"name":"Fresh Chopped Basil","unit":"g","amount":"30"},{"name":"Salt and Pepper","unit":"ml","amount":"5"}]}],"steps":["1) Preheat your oven to 400 degrees, line a baking sheet with aluminum foil and set aside.","\n2) Fill a large pot with water, sprinkle in a good amount of salt and bring to a boil.","3) Add the cubed eggplant to the baking sheet and drizzle over some olive oil, season with salt and pepper and toss. Bake for about 20 minutes or so.","4) In a non stick pan add the 2 tbsp of olive oil and onions, cook over medium heat for about 5 to 7 minutes or until the onions start to cook down and develop some color. Add the garlic and cook for 1 more minute.","5) Add the crushed tomatoes and season with salt and pepper, cook for about 20 minutes or until the sauce thickens.","6) Add the roasted eggplant and cook for 10 more minutes. This is the point where you add the pasta to the salted boiling water and cook according to package instructions.\n","7) Drain the pasta and remove the sauce from the heat. Adjust the seasoning and add the pasta to the sauce along with the pramiggiano and basil. Toss until the pasta is coated in the sauce then add the cubed mozzarella and toss around some more until the mozzarella slowly starts to melt."],"photo":{"url":"https://media.graphcms.com/KeFdMmCEQMavw0saUJKH"},"tags":[{"id":"ckqc1foioykqz0b56lc0cj6wr"}]}