{"id":"ckr56jd3c9brp0c459altk0ig","timeInMinutes":25,"name":" Cacciatore Veg","description":"If you are a vegetarian this is a meal for you or even if you want to loose some weight.","photo":{"url":"https://media.graphcms.com/PKMba9MZRmeDY2XYhPtl"},"ingredients":[{"ingredients":[{"name":"Medium Eggplant, cut into about 1 inch cubes","unit":"g","amount":"180"},{"name":"Cremini Mushrooms, quartered","unit":"g","amount":"310"},{"name":"Red Bell Pepper, cut inch chuncks","unit":"g","amount":"75"},{"name":"Onion, chopped","unit":"g","amount":"30"},{"name":"Can of Italian Peeled and Chopped Tomatoes","unit":"g","amount":"750"},{"name":"Red Wine","unit":"ml","amount":"125"},{"name":"Extra Virgin Olive Oil","unit":"ml","amount":"60"},{"name":"Fresh Basil, chopped","unit":"g","amount":"15"},{"name":"Fresh Parley, chopped","unit":"g","amount":"15"},{"name":"Hot Pepper Flakes","unit":"ml","amount":"5"},{"name":"Whole Wheat Pasta","unit":"g","amount":"500"},{"name":"Salt and Pepper, to taste","unit":"g","amount":"5"}]}],"steps":["1) Fill a large pot with water, sprinkle in some salt and bring it to a boil.","2) In a large non stick skillet over high heat, add in about 2 Tbsp of olive oil and let it get nice and hot, add the eggplant, season with salt and pepper and let it cook for 4 to 5 minutes or until the eggplant starts to cook down and develop color, remove to a plate and set aside.","3) In the same skillet, add in another Tbsp of oil and let it get hot, add the mushrooms and season with some salt, let those cook for 3 to 4 minutes or until the mushrooms have cooked down, remove the mushrooms to a plate and set aside.","4) In the same skillet, add in another Tbsp of oil and add in the onions and peppers, season with salt and cook those as well for 3 to 4 minutes. Add the garlic and hot pepper flakes and cook for an additional 30 seconds.","5) Add the cooked eggplant and mushrooms to the peppers and onion and add in the wine, let it cook for 1 minute.","6) Add the crushed tomatoes, reduce the heat to medium-low and let it cook for 20 minutes or until the sauce has thickened. When the sauce has 10 minutes left to cook, add the pasta to the boiling water and cook it according to package directions making sure to drain well.","7) Season with some more salt and pepper to taste, add in the basil and parsley and add it to the cooked pasta."]}