[{"id":"cko2wnze0qyz30c60ysknlj32","name":"vegetarian ","description":null},{"id":"cko2woa6wqu7b0c46sitenfkz","name":"weightloss","description":null},{"id":"ckq3n5lw0bqeo0b56woalar89","name":"salmon","description":"recipe contains salmon"},{"id":"ckq3n6do0bly90b56r9sz6ucr","name":"fish","description":"recipe contains fish,Fish is filled with omega-3 fatty acids and vitamins such as D and B2 (riboflavin). Fish is rich in calcium and phosphorus and a great source of minerals, such as iron, zinc, iodine, magnesium, and potassium"},{"id":"ckq3na1m0bq1a0b55qpxpc1nm","name":"salad","description":null},{"id":"ckq3nmu9cbs5w0b55lnwjud61","name":"arugula","description":"recipe contains arugula"},{"id":"ckq3numcobuaj0b56cr5jdghx","name":"weightLoss","description":"meal helps with weightLoss."},{"id":"ckq3nvppcbpo30b562wvfrl0k","name":"dessert","description":null},{"id":"ckq3nwee8btxj0b55aelwpx3d","name":"highsugar","description":null},{"id":"ckq3o6htkbwmi0b56zhhaptfs","name":"Cream","description":"this meal is rich since it contains cream and butter."},{"id":"ckq7q0ilcczdm0b57j6tx5gsf","name":"Zucchini","description":"This meal contains  zucchini,and mostly cheese in it"},{"id":"ckq7qa5tcdesb0a60i642qm0d","name":"parmesan cheese","description":"\nParmesan is familiar to most people as a sharp, hard cheese, usually shredded or grated and used as a garnish or accent. "},{"id":"ckq7qjyfsdi210a60xzj21q06","name":"Pasta","description":"Pasta is a type of food typically made from an unleavened dough of wheat flour mixed with water or eggs, and formed into sheets or other shapes, then cooked by boiling or baking. ... Pasta is a staple food of Italian cuisine.\n"},{"id":"ckq7qmjswdcnf0b56hlt5eclm","name":"Heavy cream","description":"Thick cream that contains a lot of milk fat; double cream."},{"id":"ckq7qt4oodltv0b56ejiuoem4","name":"Simple salad","description":"A  simple Salad usually consists of a single kind of vegetable, fruit, meat etc. tossed in a dressing as a base with one or two ingredients, in small quantities are used for decoration or as a garnish"},{"id":"ckq7qw7sodolz0b56504r8yir","name":"Avocado","description":"Also known as an alligator pear or butter fruit, the versatile avocado is the only fruit that provides a substantial amount of healthy monounsaturated fatty acids "},{"id":"ckq9bu10802eb0b55u5z8vo8x","name":"Zucchin","description":"Cancer Prevention. Zucchini contains zeaxanthin and several other compounds that can play a role in preventing oxidative stress. · Diabetes ."},{"id":"ckqaqgux4j8nc0a10c0fggcez","name":"Butter","description":"rich meal that is good for the whole family."},{"id":"ckqaqmy20jzm50b56ubodfdwr","name":"Bacon and Chicken","description":"Yummy meal with Bacon and chicken pasta"},{"id":"ckqaqugw0jl5p0b57jjkzw5q5","name":"Beaf ","description":"This meal also contains ribs to make it delicious."},{"id":"ckqar0emgk5ik0b55jmo5co3z","name":"Bacon","description":"This meal contains bacon and chicken, that's yummy for everyone."},{"id":"ckqar3we8k9pm0b56pe5b9b97","name":"Chicken","description":"Delicious meal that contains chicken in it."},{"id":"ckqb37wdsokm10a10traxrgus","name":"tomatoPaste","description":"this meal contains a variate of sauce but a delicious meal for the family."},{"id":"ckqb3cmwoos8h0b57t5vsvnx8","name":"Mustard","description":"This dish contains the whole grain mustard ."},{"id":"ckqb3idp4p8uv0b555vcnktty","name":"Olive oil","description":"This dish contains a oils and heavy creams but its a delicious meal for the family."},{"id":"ckqb3ltxcpaxn0b55wz64ic65","name":"Corn","description":"Health meal for the family."},{"id":"ckqb3qtpkpddv0b55puc049lf","name":"Eggplant","description":"NIce meal for family and friends."},{"id":"ckqb3u5b4pjon0b5684i61g3o","name":"Vodka","description":"Nice meal that contains some vodka to adds more delicious flavor."},{"id":"ckqb3x6vkozt50c56t8q1p7r0","name":"Turkey","description":"If you like turkey you  must try this recipe you will love it."},{"id":"ckqb414uopnyx0b568hkjma1u","name":"Tuna","description":"the dish contains some tuna if seafood is your favourite you can give it try."},{"id":"ckqb445ncppue0b56v9ihk93k","name":"Broccoli","description":"Enjoy this easy home made meal with your family and friends."},{"id":"ckqb48fywpny60b55x6gci94g","name":"chicken","description":"This pasta contains chicken to make it yummy."},{"id":"ckqb7c068qqzr0b55dnr8jk6x","name":"Baby Spinach","description":"Good dish for the whole family even kids will thank you."},{"id":"ckqb8zz4gqv3o0c5679ikv6pv","name":"Pancetta","description":"If you love bacon you will love this meal."},{"id":"ckqbzfpgwxqmm0b55k60s905a","name":"Red Wine ","description":"This meal have nice ingredients to come up with a nice yummy flavor."},{"id":"ckqc1foioykqz0b56lc0cj6wr","name":"mozzarella","description":"This meal is delicious and easy to make within a short period of time."},{"id":"ckqc93q0o1b9q0b561wxnbdif","name":" zucchini","description":"You will love this meal as a family."},{"id":"ckqm58a54ifr00b08gcl9sjlv","name":"beef","description":"this meal  contains beef"},{"id":"ckqm5qmmw032y0a03upb34s0o","name":"egg","description":"This meal contains egg yolks ,Graham crackers ,Sweetened condensed milk,Key lime juice ,Fresh lime zest and Heavy cream  as the main ingredients"},{"id":"ckqm6ioo0jozu0b12rr9qr0ap","name":"whole chicken","description":"The name tells it all ,this is chicken with garlic cloves"},{"id":"ckqm6qrk82d4s0c007c3dlgtm","name":"Cauliflower","description":"High in Fiber. Cauliflower is quite high in fiber, which is beneficial for overall health. Cauliflower is very low in calories yet high in vitamins. In fact, cauliflower contains some of almost every vitamin and mineral that you need "},{"id":"ckqmad7js4nbf0a035yiwtqyz","name":"ground beef","description":"It is categorized as red meat — a term used for the meat of mammals, which contains higher amounts of iron than chicken or fish."},{"id":"ckqmb6lf4oyuq0b08xuan27lv","name":"Bread","description":"Start Your Day in the French Way. In most French home, you'd be offered some French bread product, with a choice of jams, honey and butter, and a hot beverage such as coffee or tea."},{"id":"ckqmf97749z8b0c00giwcw7tg","name":"Chicken M","description":"A food rich in protein, chicken can help with weight management and reduce the risk of heart disease. "},{"id":"ckqrtxsm0ayhj0b5025d1t1g4","name":"Butter Beans","description":"Beans and legumes have a number of health benefits, including reducing cholesterol, decreasing blood sugar levels and increasing healthy gut bacteria.They are also a great replacement for meat as a source of vegetarian protein."},{"id":"ckqrumak0b8cn0b5003080p3h","name":"Cauliflower soup","description":"Cauliflower is a cruciferous vegetable that is naturally high in fiber and B-vitamins. It provides antioxidants and phytonutrients that can protect against cancer. It also contains fiber to enhance weight loss and digestion, choline that is essential for learning and memory, and many other important nutrient"},{"id":"ckqruq9awb44w0b52tyijyfhm","name":"Potatoes","description":"Potatoes are a good source of fiber, which can help you lose weight by keeping you full longer. Fiber can help prevent heart disease by keeping cholesterol and blood sugar levels in check. Potatoes are also full of antioxidants that work to prevent diseases and vitamins that help your body function properly."},{"id":"ckqs08jf4dj4v0b50m4i8ojz1","name":"peas","description":"Peas are a good source of vitamins C and E, zinc, and other antioxidants that strengthen your immune system. Other nutrients, such as vitamins A and B , help reduce inflammation and lower your risk of chronic conditions, including diabetes, heart disease, and arthritis"},{"id":"ckqs0cb80df0v0b9875x5jfh2","name":"Zucchini ","description":"Cancer Prevention. Zucchini contains zeaxanthin and several other compounds that can play a role in preventing oxidative stress"},{"id":"ckqs0dolsditd0b52qm7r24bt","name":"Heavy Cream","description":null},{"id":"ckqtfrb0w0ef40b52lpzj8yem","name":"pasta","description":"Pasta is made from grain, one of the basic food groups in a healthy diet that also can include vegetables, fruits, fish, and poultry. It's a good source of energy and can give you fiber, too, if it's made from whole grain. That can help with stomach problems and may help lower cholesterol."},{"id":"ckqtfw33c0gl30b98l826a2cz","name":"tomatoes","description":"Tomatoes are the major dietary source of the antioxidant lycopene, which has been linked to many health benefits, including reduced risk of heart disease and cancer. They are also a great source of vitamin C, potassium, folate, and vitamin K"},{"id":"ckqtg2dy00pp00b98suv22fso","name":"egg plant","description":"Eggplants are rich in fiber and antioxidants. A serving of eggplant can provide at least 5% of a person's daily requirement of fiber, copper, manganese, B-6, and thiamine. It also contains other vitamins and minerals. In addition, eggplants are a source of phenolic compounds that act as antioxidants"},{"id":"ckqtgxleg1n7i0c093rk6c700","name":"Cornmeal","description":null},{"id":"ckqth60n41ozy0c95ak8o3eyd","name":"pumpkin puree","description":null},{"id":"ckqthd74o1u710c95qoogykq6","name":"eggplant","description":"Eggplants are rich in fiber and antioxidants. A serving of eggplant can provide at least 5% of a person's daily requirement of fiber, copper, manganese, B-6, and thiamine. It also contains other vitamins and minerals. In addition, eggplants are a source of phenolic compounds that act as antioxidants."},{"id":"ckqthirqw1sm00b52ppgl50zh","name":"cabbage","description":null},{"id":"ckqthpisw1wcx0c05sgs0bx9f","name":"green beans","description":null},{"id":"ckqtj3ocw2ugw0b50ud36qrgd","name":"bacon","description":"Bacon is a type of salt-cured pork made from various cuts, typically from the pork belly or from the less fatty back cuts"},{"id":"ckqtjjux42vmy0b98txt10ktp","name":"cucumber","description":"ways in which your body will react if you eat cucumbers every day · 1. Your body will stay hydrated · 2. It will prevent constipation"},{"id":"ckqtjncow2xe10b98foqz70wy","name":"meat balls","description":"This is homemade meatball recipe "},{"id":"ckqtpndp46uuf0b98cvt8zozl","name":"honey","description":"On one hand, it can reduce several risk factors for heart disease common in people with type 2 diabetes."},{"id":"ckqtpp9lk7d2n0b506jsr11a6","name":"Thyme","description":"Thyme is an herb from the mint family that you probably recognize from your spice set. But it’s so much more than an after-thought ingredient."},{"id":"ckqtpzkqo74100b52ypah4p36","name":"carrots","description":"Image result for carrots health benefits\nIt is crunchy, tasty, and highly nutritious. Carrots are a particularly good source of beta carotene, fiber, vitamin K1, potassium, and antioxidants ( 1 ). They also have a number of health benefits. They're a weight-loss-friendly food and have been linked to lower cholesterol levels and improved eye health"},{"id":"ckqtqkeqo7de20c05tb2ila64","name":"Brussels Sprouts","description":"They’re also high in vitamin C, an antioxidant that helps promote iron absorption and is involved in tissue repair and immune function"},{"id":"ckqtqpm8o7mqb0b50jq4houja","name":"mushrooms","description":"Mushrooms are a rich, low calorie source of fiber, protein, and antioxidants. They may also mitigate the risk of developing serious health conditions, such as Alzheimer's, heart disease, cancer, and diabetes. They're also great sources of: Selenium."},{"id":"ckqtqruhk7b5g0b52nitss38n","name":"tuna","description":"The high levels of omega-3 fatty acids in tuna fish may help to reduce the level of omega-6 fatty acids and LDL cholesterol that can accumulate inside the arteries of the heart. Studies have shown that eating more omega-3 is associated with reduced rates of cardiovascular disease, including heart attack"},{"id":"ckqtsxcm08d5f0b984hnw96wy","name":"ham","description":"Ham is pork from a leg cut that has been preserved by wet or dry curing, with or without smoking. "},{"id":"ckqtt13n407ig0e11uppzbgkz","name":"cheese","description":"Cheese is a dairy product, derived from milk and produced in wide ranges of flavors, textures and forms by coagulation of the milk protein casein. It comprises proteins and fat from milk, usually the milk of cows, buffalo, goats, or sheep"},{"id":"ckqtth5ko96kg0c05085tn2ok","name":"Meatloaf","description":"One of the main drawbacks to the typical meatloaf is the high fat content."},{"id":"ckqtvfl2g2kr80a50l9w0y3xg","name":"turkey","description":"The dark meat of a turkey tends to contain more vitamins and minerals but also has more fat and calories.\n\n"},{"id":"ckqtvzrx43gz40a50c4ltn4oi","name":"Peanut Sauce","description":"It tastes so good that it can't be healthy and, guess what? It's not. With ingredients like peanut butter, full-fat coconut milk, peanuts, sugar or honey, soy sauce (an ingredient which can dehydrate you and can stain your teeth), and an oil, these sauces should be enjoyed with caution"},{"id":"ckqtw2gdcbuvf0b9880keq6d6","name":"meat sauce","description":"While it's delicious, the fat and carbs in spaghetti with meat sauce can often overwhelm the healthy aspects of this dish. One serving of spaghetti with meat sauce can contain 670 calories and nearly 20 grams of fat. ... Pasta may be high in carbs, but it's low in fat and also contains a good deal of fiber"},{"id":"ckqtwewo8cc6l0b98zpk0evx7","name":"Salad dish","description":"salad recipes are perfect for lunches, summer cookouts, and dinner parties! Healthy and delicious, each one can double as a main or side dish!"},{"id":"ckqtwtob4dnus0b509963lvjj","name":"rice","description":"Rice is the seed of the grass species Oryza sativa or less commonly Oryza glaberrima. The name wild rice is usually used for species of the genera Zizania and Porteresia, both wild and domesticated, although the term may also be used for primitive or uncultivated varieties of Oryz"},{"id":"ckqtwxhnkd9ia0b98ep0sk81k","name":"ribs","description":"Seven ribs which connect directly to the sternum (1-7) Three ribs which connect to the costal cartilages of the rib above (8-10) Two \"floating\" ribs which connect only at the back"},{"id":"ckqtxhyjce4nx0b98cifpbi79","name":"coffee","description":"Coffee is a brewed drink prepared from roasted coffee beans, the seeds of berries from certain Coffea species. All fruit must be further processed from a raw​ "},{"id":"ckqtxmoagennm0c05duom2uo7","name":" beverage","description":"a drink other than water."},{"id":"ckquzyxc05kvw0c06c3h4h31n","name":"Cheese","description":"This recipe is delicious and quick to make ."},{"id":"ckqv1nesw707k0b51s1nn7szn","name":"Kalamata Olives","description":"This meal is good and health for everyone."},{"id":"ckqv2nocw77dm0c06m1qq2m30","name":"Boiled Eggs","description":"Nice heavy meal to feed the whole family."},{"id":"ckqynfl3s6nk00c0818cgtq0t","name":"Basil Leaves","description":"Meal for family or at any event."},{"id":"ckr4ypq7c0jy10c44kxj0qk7e","name":"Sweet Potatoes","description":"This meal its good for the family and enjoyable during winter time."},{"id":"ckr4zo3341nab0c44xoiw5sl8","name":"Ham","description":"This meal have ham and mushrooms which make it a nice taste meal enjoy."},{"id":"ckr50cl142wk70b51qh6vtvmk","name":"Parmiggiano Reggiano","description":"Parmiggiano Reggiano cheese from Italy this makes this meal nice and rich"},{"id":"ckr568pls8fhy0c444dsj6op2","name":"Red Wine","description":"If you like hot food this is a good to go meal enjoy."},{"id":"ckr57vb68a78c0c59quzekr2d","name":"White wine","description":"This meal is great when you have visitors its quick to make enjoy."}]